hiperiondev/esp32idf_APRS/components/message/message.c
    if (!s_alarmTimer) {
        const esp_timer_create_args_t args = {
            .callback = alarmTimerCb,
            .name = "msg_alarm",
        };
        if (esp_timer_create(&args, &s_alarmTimer) != ESP_OK) {
            ESP_LOGW(TAG, "Message Alarm: failed to create timer, disabling");
            s_alarmGpio = -1;
            return;
        }
    }

    gpio_reset_pin((gpio_num_t)s_alarmGpio);
    gpio_set_direction((gpio_num_t)s_alarmGpio, GPIO_MODE_OUTPUT);
    gpio_set_level((gpio_num_t)s_alarmGpio, 0); // idle low until a message arrives
    ESP_LOGI(TAG, "Message Alarm: GPIO%d enabled", (int)s_alarmGpio);
}

// Pulses the alarm pin high for MSG_ALARM_PULSE_MS. Called each time a direct
// message for g_config.msg_mycall is received. Re-arms the timer on every
// call, so back-to-back messages keep the pin high without flickering, and it
// only drops back to 0 once MSG_ALARM_PULSE_MS elapses with no new message.
static void message_alarm_pulse(void) {
    if (s_alarmGpio < 0 || !s_alarmTimer)
        return;

    gpio_set_level((gpio_num_t)s_alarmGpio, 1);
    esp_timer_stop(s_alarmTimer); // no-op if not currently running
    esp_timer_start_once(s_alarmTimer, (uint64_t)MSG_ALARM_PULSE_MS * 1000ULL);
}

// ---------------------------------------------------------------------------
// Helpers: trim, uppercase
// ---------------------------------------------------------------------------
static void trimUpper(char *s) {
    // trim
    char *start = s;
    while (*start && isspace((unsigned char)*start))
        start++;
    if (start != s)
        memmove(s, start, strlen(start) + 1);
    size_t len = strlen(s);
    while (len > 0 && isspace((unsigned char)s[len - 1]))
        s[--len] = 0;
    for (size_t i = 0; i < len; i++)
        s[i] = toupper((unsigned char)s[i]);
}

// Compares two callsigns ignoring any "-SSID" suffix, so a message sent to
// "N0CALL", "N0CALL-0".."N0CALL-15" (or any other/garbled SSID) is treated
// as addressed to station "N0CALL". Case-insensitive; SSID digits themselves
// are not validated, only stripped.
static bool callsignBaseMatch(const char *a, const char *b) {
    size_t na = 0, nb = 0;
    while (a[na] && a[na] != '-')
        na++;
    while (b[nb] && b[nb] != '-')
        nb++;
    if (na == 0 || na != nb)
        return false;
    return strncasecmp(a, b, na) == 0;
}

// ---------------------------------------------------------------------------
// Reply-ACK: reading a received identifier and building an outgoing one
// ---------------------------------------------------------------------------

// Reads a message number written as plain decimal digits. Anything else - an
// empty field, an alphanumeric identifier another client may have issued, a
// value past the width of the field - is refused, because the only numbers
// matched against the outbound queue are the ones this station issued itself.
static bool parseMsgNumber(const char *s, uint16_t *out) {
    if (s == NULL || s[0] == 0)
        return false;

    unsigned long v = 0;
    for (size_t i = 0; s[i]; i++) {
        if (i >= 5 || s[i] < '0' || s[i] > '9')
            return false;
        v = v * 10 + (unsigned long)(s[i] - '0');
    }
    if (v > UINT16_MAX)
        return false;

    *out = (uint16_t)v;
    return true;
}

// Splits a received message identifier into the sender's own number and the
// free acknowledgement it carries: "MM}AA" gives both, "MM}" gives the number
// and an empty acknowledgement, and a plain "MM" gives the number alone. Both
// outputs are always NUL-terminated.
static void splitReplyAck(const char *msgNo, char *own, size_t own_size, char *ack, size_t ack_size) {
    own[0] = 0;
    ack[0] = 0;

    const char *sep = strchr(msgNo, '}');
    size_t n = sep ? (size_t)(sep - msgNo) : strlen(msgNo);
    if (n > own_size - 1)
        n = own_size - 1;
    memcpy(own, msgNo, n);
    own[n] = 0;

    if (sep) {
        strncpy(ack, sep + 1, ack_size - 1);
        ack[ack_size - 1] = 0;
    }
}

// Records the acknowledgement now owed to a station. A station already in the
// table keeps its slot and has its number replaced, so only the latest one is
// ever owed; a new station takes a free slot, or the one written longest ago.
static void replyAckRemember(const char *call, const char *mm) {
    if (call[0] == 0 || mm[0] == 0)
        return;

    int slot = -1;
    uint32_t oldest = 0;
    for (int i = 0; i < MSG_REPLY_ACK_STATIONS; i++) {
        if (strcmp(s_replyAck[i].callsign, call) == 0) {
            slot = i;
            break;
        }
        if (s_replyAck[i].callsign[0] == 0) {
            slot = i;
            break;
        }
        if (slot < 0 || s_replyAck[i].seq < oldest) {
            oldest = s_replyAck[i].seq;
            slot = i;
        }
    }

    memset(s_replyAck[slot].callsign, 0, sizeof(s_replyAck[slot].callsign));
    strncpy(s_replyAck[slot].callsign, call, sizeof(s_replyAck[slot].callsign) - 1);
    memset(s_replyAck[slot].mm, 0, sizeof(s_replyAck[slot].mm));
    strncpy(s_replyAck[slot].mm, mm, sizeof(s_replyAck[slot].mm) - 1);
    s_replyAck[slot].seq = ++s_replyAckSeq;
}

// Builds the message-number suffix of an outgoing message: "{MM}" on its own,
// or "{MM}AA" when this station owes that correspondent an acknowledgement.
// Called at the moment a frame is built rather than when the message is queued,
// so a retry carries whatever is owed by then and not what was owed when the
// operator wrote the message. The trailing brace is present either way: it is
// what tells the other end that a Reply-ACK can be sent back.
//
// Callsigns are matched exactly, the same rule pkgMsg_Find() applies to an
// incoming ack, so an acknowledgement owed to one SSID of a station is never
// attached to a message addressed to another.
static void buildMsgNumberSuffix(const char *call, uint16_t msgID, char *out, size_t out_size) {
    const char *owed = "";
    for (int i = 0; i < MSG_REPLY_ACK_STATIONS; i++) {
        if (s_replyAck[i].callsign[0] && strcmp(s_replyAck[i].callsign, call) == 0) {
            owed = s_replyAck[i].mm;
            break;
        }
    }
    snprintf(out, out_size, "{%02u}%s", (unsigned)msgID, owed);
}

// ---------------------------------------------------------------------------
// Queue management
// ---------------------------------------------------------------------------
int pkgMsg_Find(const char *call, uint16_t msgID, bool rxtx) {
    // Exact match only. s_queue[i].callsign is always NUL-terminated (see
    // pkgMsgStore(), which memset()s the field before strncpy()) and always
    // upper case, as is every callsign reaching this function, so a plain
    // strcmp() is safe here. A substring search would be wrong: a stored
    // "N0CALL" would match an incoming "N0CALL-9" and vice versa, and two
    // unrelated callsigns could coincidentally overlap, letting an ack/reply
    // from the wrong station mark another station's queued message as
    // acknowledged.
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (s_queue[i].used && s_queue[i].msgID == msgID && s_queue[i].rxtx == rxtx && strcmp(s_queue[i].callsign, call) == 0)
            return i;
    }
    return -1;
}

// Picks the slot the next message goes into: a free one while the queue is
// filling up, otherwise the slot holding the oldest message of the whole
// conversation, received or outbound. Age is taken from the insertion counter
// rather than from the wall clock, so the choice stays right while the system
// clock is still unset and when NTP steps it.
static int pkgMsgEvictSlot(void) {
    int ret = 0;
    uint32_t oldest = 0;
    for (int i = 0; i < MSG_QUEUE_SIZE; i++) {
        if (!s_queue[i].used)
            return i;
        if (i == 0 || s_queue[i].seq < oldest) {
            oldest = s_queue[i].seq;
            ret = i;
        }
    }
    return ret;
}

// Appends one message to the conversation. Every call takes a slot of its own,
// so a received message sits in the history next to the ones this station sent
// and stays there until MSG_QUEUE_SIZE newer messages have pushed it out.
static int pkgMsgStore(const char *call, const char *text, uint16_t msgID, int8_t ack, bool rxtx) {
    if (!call[0] || !text[0])
        return -1;

